app/controllers/locations_controller.rb

SELECT `locations`.* FROM `locations`
---
  def index
    @locations = Location.all

SELECT `locations`.* FROM `locations` WHERE `locations`.`id` = 1 LIMIT 1
---
  def show
    @location = Location.find(params[:id])

SELECT `locations`.* FROM `locations` WHERE `locations`.`id` = 1 LIMIT 1
---
  def edit
    @location = Location.find(params[:id])

INSERT INTO `locations` (`created_at`, `lat`, `long`, `updated_at`) VALUES ('2012-06-06 01:22:29', 181.243143, -123.4567891, '2012-06-06 01:22:29')
---
  def create
    @location = Location.new(params[:location])

    respond_to do |format|
      if @location.save

SELECT `locations`.* FROM `locations` WHERE `locations`.`id` = 1 LIMIT 1
---
  def update
    @location = Location.find(params[:id])