app/controllers/places_controller.rb

SELECT `places`.* FROM `places`
---
  def index
    @places = Place.all

SELECT `places`.* FROM `places` WHERE `places`.`id` = 1 LIMIT 1
---
  def edit
    @place = Place.find(params[:id])

INSERT INTO `places` (`created_at`, `external_id`, `location_id`, `name`, `updated_at`) VALUES ('2012-06-06 01:05:08', 'dkfaldjafsdf', 12345, 'Moogatoosh', '2012-06-06 01:05:08')
---
  def create
    @place = Place.new(params[:place])

    respond_to do |format|
      if @place.save

SELECT `places`.* FROM `places` WHERE `places`.`id` = 1 LIMIT 1
UPDATE `places` SET `external_id` = 'dkfaldjafs98989', `updated_at` = '2012-06-06 01:05:21' WHERE `places`.`id` = 1
---
  def update
    @place = Place.find(params[:id])

    respond_to do |format|
      if @place.update_attributes(params[:place])

SELECT `places`.* FROM `places` WHERE `places`.`id` = 980190962 LIMIT 1
DELETE FROM `places` WHERE `places`.`id` = 980190962
---
  def destroy
    @place = Place.find(params[:id])
    @place.destroy